% Лабораторная работа № 1.2. «Лексический анализатор на основе регулярных выражений»
% 6 марта 2023 г.
% Павел Богданов, ИУ9-61Б

# Цель работы
Целью данной работы является приобретение навыка разработки простейших лексических анализаторов,
работающих на основе поиска в тексте по образцу, заданному регулярным выражением.

# Индивидуальный вариант
-   Идентификаторы: либо последовательности латинских букв, либо непустые последовательности десятичных
цифр, ограниченные круглыми скобками.
-   Числовые литералы: либо последовательности десятичных цифр, не начинающиеся с нуля, либо «`0`».
-   Операции: «`()`», «`:`», «`:=`».

# Реализация

```python 
import re  
Variable_pattern = "^([a-zA-Z]+|\([0-9]+\))$"  
Operation_pattern = "^(\(\)|:|:=)$"  
Num_pattern = "^(0|[1-9][0-9]*)$"  
def lexer(path):  
    array = []  
    for i, line in enumerate(open(path)):  
        line = line.replace("\n","")  
        words = line.split(" ")  
        counter = 0  
  for j in words:  
            if re.fullmatch(Operation_pattern, j):  
                array.append(['Op', [i,counter],j])  
                #print('Operation (' + str(i) +" "+ str(counter)+") "+ j)  
  counter+=len(j)+1  
  elif re.fullmatch(Variable_pattern, j):  
                array.append(['Var', [i,counter],j])  
                #print('Variable (' + str(i) +" "+ str(counter)+") "+ j)  
  counter += len(j)+1  
  elif re.fullmatch(Num_pattern,j):  
                array.append(['Num', [i,counter],j])  
                #print('Number (' + str(i) + " " + str(counter) + ") " + j)  
  counter += len(j)+1  
  else:  
                array.append(['Error', [i,counter],j])  
                #print('Error (' + str(i) + " " + str(counter) + ") " + j)  
  counter += len(j)+1  
  for i in range(len(array)):  
        print(array[i])  
  
lexer('test.txt')
```

# Тестирование

Входные данные

```
jkjdskfj
(1293102)
9091239
0
(213123
032423
()
:
kdjfkjd := () 923992
```

Вывод на `stdout`

```
Variable (0 0) jkjdskfj
Variable (1 0) (1293102)
Number (2 0) 9091239
Number (3 0) 0
Error (4 0) (213123
Error (5 0) 032423
Operation (6 0) ()
Operation (7 0) :
Variable (8 0) kdjfkjd
Operation (8 8) :=
Operation (8 11) ()
Number (8 14) 923992
```

# Вывод
В ходе данной лабораторной работы был получен навык разработки простейшего лексического анализатора, 
работающего на основе поиска в тексте по образцу, заданному регулярным выражением, в соответствии с 
индивидуальным вариантом были написаны регулярные выражения, отвечающие заданным условиям. 
Лексический анализатор на регулярных выражениях получился довольно компактным, и с некоторой практикой их
можно делать довольно быстро, что является несомненным их преимуществом. В процессе его создания не
возникло особых сложностей с его реализацией. Также можно отметить, что лучше всего в процессе его
разработки, возвращать данные из него в формате. где указывается и распознанный токен, и позиция и его
тег, для удобства отслеживания проблем, связанных с неправильным распознаванием.